GopalSaraf/Practicals/PSDL/include/proc/pic18f15q41.h
extern volatile SPI2TCNTHbits_t SPI2TCNTHbits __at(0x090);
// bitfield macros
#define _SPI2TCNTH_TCNTH_POSN                               0x0
#define _SPI2TCNTH_TCNTH_POSITION                           0x0
#define _SPI2TCNTH_TCNTH_SIZE                               0x3
#define _SPI2TCNTH_TCNTH_LENGTH                             0x3
#define _SPI2TCNTH_TCNTH_MASK                               0x7

// Register: SPI2CON0
#define SPI2CON0 SPI2CON0
extern volatile unsigned char           SPI2CON0            __at(0x091);
#ifndef _LIB_BUILD
asm("SPI2CON0 equ 091h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BMODE                  :1;
        unsigned MST                    :1;
        unsigned LSBF                   :1;
        unsigned                        :4;
        unsigned EN                     :1;
    };
    struct {
        unsigned SPI2BMODE              :1;
        unsigned SPI2MST                :1;
        unsigned SPI2LSBF               :1;
        unsigned                        :4;
        unsigned SPI2SPIEN              :1;
    };
} SPI2CON0bits_t;
extern volatile SPI2CON0bits_t SPI2CON0bits __at(0x091);
// bitfield macros
#define _SPI2CON0_BMODE_POSN                                0x0
#define _SPI2CON0_BMODE_POSITION                            0x0
#define _SPI2CON0_BMODE_SIZE                                0x1
#define _SPI2CON0_BMODE_LENGTH                              0x1
#define _SPI2CON0_BMODE_MASK                                0x1
#define _SPI2CON0_MST_POSN                                  0x1
#define _SPI2CON0_MST_POSITION                              0x1
#define _SPI2CON0_MST_SIZE                                  0x1
#define _SPI2CON0_MST_LENGTH                                0x1
#define _SPI2CON0_MST_MASK                                  0x2
#define _SPI2CON0_LSBF_POSN                                 0x2
#define _SPI2CON0_LSBF_POSITION                             0x2
#define _SPI2CON0_LSBF_SIZE                                 0x1
#define _SPI2CON0_LSBF_LENGTH                               0x1
#define _SPI2CON0_LSBF_MASK                                 0x4
#define _SPI2CON0_EN_POSN                                   0x7
#define _SPI2CON0_EN_POSITION                               0x7
#define _SPI2CON0_EN_SIZE                                   0x1
#define _SPI2CON0_EN_LENGTH                                 0x1
#define _SPI2CON0_EN_MASK                                   0x80
#define _SPI2CON0_SPI2BMODE_POSN                            0x0
#define _SPI2CON0_SPI2BMODE_POSITION                        0x0
#define _SPI2CON0_SPI2BMODE_SIZE                            0x1
#define _SPI2CON0_SPI2BMODE_LENGTH                          0x1
#define _SPI2CON0_SPI2BMODE_MASK                            0x1
#define _SPI2CON0_SPI2MST_POSN                              0x1
#define _SPI2CON0_SPI2MST_POSITION                          0x1
#define _SPI2CON0_SPI2MST_SIZE                              0x1
#define _SPI2CON0_SPI2MST_LENGTH                            0x1
#define _SPI2CON0_SPI2MST_MASK                              0x2
#define _SPI2CON0_SPI2LSBF_POSN                             0x2
#define _SPI2CON0_SPI2LSBF_POSITION                         0x2
#define _SPI2CON0_SPI2LSBF_SIZE                             0x1
#define _SPI2CON0_SPI2LSBF_LENGTH                           0x1
#define _SPI2CON0_SPI2LSBF_MASK                             0x4
#define _SPI2CON0_SPI2SPIEN_POSN                            0x7
#define _SPI2CON0_SPI2SPIEN_POSITION                        0x7
#define _SPI2CON0_SPI2SPIEN_SIZE                            0x1
#define _SPI2CON0_SPI2SPIEN_LENGTH                          0x1
#define _SPI2CON0_SPI2SPIEN_MASK                            0x80

// Register: SPI2CON1
#define SPI2CON1 SPI2CON1
extern volatile unsigned char           SPI2CON1            __at(0x092);
#ifndef _LIB_BUILD
asm("SPI2CON1 equ 092h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SDOP                   :1;
        unsigned SDIP                   :1;
        unsigned SSP                    :1;
        unsigned                        :1;
        unsigned FST                    :1;
        unsigned CKP                    :1;
        unsigned CKE                    :1;
        unsigned SMP                    :1;
    };
    struct {
        unsigned SPI2SDOP               :1;
        unsigned SPI2SDIP               :1;
        unsigned SPI2SSP                :1;
        unsigned                        :1;
        unsigned SPI2FST                :1;
        unsigned SPI2CKP                :1;
        unsigned SPI2CKE                :1;
        unsigned SPI2SMP                :1;
    };
} SPI2CON1bits_t;
extern volatile SPI2CON1bits_t SPI2CON1bits __at(0x092);
// bitfield macros
#define _SPI2CON1_SDOP_POSN                                 0x0
#define _SPI2CON1_SDOP_POSITION                             0x0
#define _SPI2CON1_SDOP_SIZE                                 0x1
#define _SPI2CON1_SDOP_LENGTH                               0x1
#define _SPI2CON1_SDOP_MASK                                 0x1
#define _SPI2CON1_SDIP_POSN                                 0x1
#define _SPI2CON1_SDIP_POSITION                             0x1
#define _SPI2CON1_SDIP_SIZE                                 0x1
#define _SPI2CON1_SDIP_LENGTH                               0x1
#define _SPI2CON1_SDIP_MASK                                 0x2
#define _SPI2CON1_SSP_POSN                                  0x2
#define _SPI2CON1_SSP_POSITION                              0x2
#define _SPI2CON1_SSP_SIZE                                  0x1
#define _SPI2CON1_SSP_LENGTH                                0x1
#define _SPI2CON1_SSP_MASK                                  0x4
#define _SPI2CON1_FST_POSN                                  0x4
#define _SPI2CON1_FST_POSITION                              0x4
#define _SPI2CON1_FST_SIZE                                  0x1
#define _SPI2CON1_FST_LENGTH                                0x1
#define _SPI2CON1_FST_MASK                                  0x10
#define _SPI2CON1_CKP_POSN                                  0x5
#define _SPI2CON1_CKP_POSITION                              0x5
#define _SPI2CON1_CKP_SIZE                                  0x1
#define _SPI2CON1_CKP_LENGTH                                0x1
#define _SPI2CON1_CKP_MASK                                  0x20
#define _SPI2CON1_CKE_POSN                                  0x6
#define _SPI2CON1_CKE_POSITION                              0x6
#define _SPI2CON1_CKE_SIZE                                  0x1
#define _SPI2CON1_CKE_LENGTH                                0x1
#define _SPI2CON1_CKE_MASK                                  0x40
#define _SPI2CON1_SMP_POSN                                  0x7
#define _SPI2CON1_SMP_POSITION                              0x7
#define _SPI2CON1_SMP_SIZE                                  0x1
#define _SPI2CON1_SMP_LENGTH                                0x1
#define _SPI2CON1_SMP_MASK                                  0x80
#define _SPI2CON1_SPI2SDOP_POSN                             0x0
#define _SPI2CON1_SPI2SDOP_POSITION                         0x0
#define _SPI2CON1_SPI2SDOP_SIZE                             0x1
#define _SPI2CON1_SPI2SDOP_LENGTH                           0x1
#define _SPI2CON1_SPI2SDOP_MASK                             0x1
#define _SPI2CON1_SPI2SDIP_POSN                             0x1
#define _SPI2CON1_SPI2SDIP_POSITION                         0x1
#define _SPI2CON1_SPI2SDIP_SIZE                             0x1
#define _SPI2CON1_SPI2SDIP_LENGTH                           0x1
#define _SPI2CON1_SPI2SDIP_MASK                             0x2
#define _SPI2CON1_SPI2SSP_POSN                              0x2
#define _SPI2CON1_SPI2SSP_POSITION                          0x2
#define _SPI2CON1_SPI2SSP_SIZE                              0x1
#define _SPI2CON1_SPI2SSP_LENGTH                            0x1
#define _SPI2CON1_SPI2SSP_MASK                              0x4
#define _SPI2CON1_SPI2FST_POSN                              0x4
#define _SPI2CON1_SPI2FST_POSITION                          0x4
#define _SPI2CON1_SPI2FST_SIZE                              0x1
#define _SPI2CON1_SPI2FST_LENGTH                            0x1
#define _SPI2CON1_SPI2FST_MASK                              0x10
#define _SPI2CON1_SPI2CKP_POSN                              0x5
#define _SPI2CON1_SPI2CKP_POSITION                          0x5
#define _SPI2CON1_SPI2CKP_SIZE                              0x1
#define _SPI2CON1_SPI2CKP_LENGTH                            0x1
#define _SPI2CON1_SPI2CKP_MASK                              0x20
#define _SPI2CON1_SPI2CKE_POSN                              0x6
#define _SPI2CON1_SPI2CKE_POSITION                          0x6
#define _SPI2CON1_SPI2CKE_SIZE                              0x1
#define _SPI2CON1_SPI2CKE_LENGTH                            0x1
#define _SPI2CON1_SPI2CKE_MASK                              0x40
#define _SPI2CON1_SPI2SMP_POSN                              0x7
#define _SPI2CON1_SPI2SMP_POSITION                          0x7
#define _SPI2CON1_SPI2SMP_SIZE                              0x1
#define _SPI2CON1_SPI2SMP_LENGTH                            0x1
#define _SPI2CON1_SPI2SMP_MASK                              0x80

// Register: SPI2CON2
#define SPI2CON2 SPI2CON2
extern volatile unsigned char           SPI2CON2            __at(0x093);
#ifndef _LIB_BUILD
asm("SPI2CON2 equ 093h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXR                    :1;
        unsigned TXR                    :1;
        unsigned SSET                   :1;
        unsigned                        :3;
        unsigned SSFLT                  :1;
        unsigned BUSY                   :1;
    };
    struct {
        unsigned SPI2RXR                :1;
        unsigned SPI2TXR                :1;
        unsigned SPI2SSET               :1;
        unsigned                        :3;
        unsigned SPI2SSFLT              :1;
        unsigned SPI2BUSY               :1;
    };
} SPI2CON2bits_t;
extern volatile SPI2CON2bits_t SPI2CON2bits __at(0x093);
// bitfield macros
#define _SPI2CON2_RXR_POSN                                  0x0
#define _SPI2CON2_RXR_POSITION                              0x0
#define _SPI2CON2_RXR_SIZE                                  0x1
#define _SPI2CON2_RXR_LENGTH                                0x1
#define _SPI2CON2_RXR_MASK                                  0x1
#define _SPI2CON2_TXR_POSN                                  0x1
#define _SPI2CON2_TXR_POSITION                              0x1
#define _SPI2CON2_TXR_SIZE                                  0x1
#define _SPI2CON2_TXR_LENGTH                                0x1
#define _SPI2CON2_TXR_MASK                                  0x2
#define _SPI2CON2_SSET_POSN                                 0x2
#define _SPI2CON2_SSET_POSITION                             0x2
#define _SPI2CON2_SSET_SIZE                                 0x1
#define _SPI2CON2_SSET_LENGTH                               0x1
#define _SPI2CON2_SSET_MASK                                 0x4
#define _SPI2CON2_SSFLT_POSN                                0x6
#define _SPI2CON2_SSFLT_POSITION                            0x6
#define _SPI2CON2_SSFLT_SIZE                                0x1
#define _SPI2CON2_SSFLT_LENGTH                              0x1
#define _SPI2CON2_SSFLT_MASK                                0x40
#define _SPI2CON2_BUSY_POSN                                 0x7
#define _SPI2CON2_BUSY_POSITION                             0x7
#define _SPI2CON2_BUSY_SIZE                                 0x1
#define _SPI2CON2_BUSY_LENGTH                               0x1
#define _SPI2CON2_BUSY_MASK                                 0x80
#define _SPI2CON2_SPI2RXR_POSN                              0x0
#define _SPI2CON2_SPI2RXR_POSITION                          0x0
#define _SPI2CON2_SPI2RXR_SIZE                              0x1
#define _SPI2CON2_SPI2RXR_LENGTH                            0x1
#define _SPI2CON2_SPI2RXR_MASK                              0x1
#define _SPI2CON2_SPI2TXR_POSN                              0x1
#define _SPI2CON2_SPI2TXR_POSITION                          0x1
#define _SPI2CON2_SPI2TXR_SIZE                              0x1
#define _SPI2CON2_SPI2TXR_LENGTH                            0x1
#define _SPI2CON2_SPI2TXR_MASK                              0x2
#define _SPI2CON2_SPI2SSET_POSN                             0x2
#define _SPI2CON2_SPI2SSET_POSITION                         0x2
#define _SPI2CON2_SPI2SSET_SIZE                             0x1
#define _SPI2CON2_SPI2SSET_LENGTH                           0x1
#define _SPI2CON2_SPI2SSET_MASK                             0x4
#define _SPI2CON2_SPI2SSFLT_POSN                            0x6
#define _SPI2CON2_SPI2SSFLT_POSITION                        0x6
#define _SPI2CON2_SPI2SSFLT_SIZE                            0x1
#define _SPI2CON2_SPI2SSFLT_LENGTH                          0x1
#define _SPI2CON2_SPI2SSFLT_MASK                            0x40
#define _SPI2CON2_SPI2BUSY_POSN                             0x7
#define _SPI2CON2_SPI2BUSY_POSITION                         0x7
#define _SPI2CON2_SPI2BUSY_SIZE                             0x1
#define _SPI2CON2_SPI2BUSY_LENGTH                           0x1
#define _SPI2CON2_SPI2BUSY_MASK                             0x80

// Register: SPI2STATUS
#define SPI2STATUS SPI2STATUS
extern volatile unsigned char           SPI2STATUS          __at(0x094);
#ifndef _LIB_BUILD
asm("SPI2STATUS equ 094h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXBF                   :1;
        unsigned                        :1;
        unsigned CLRBF                  :1;
        unsigned RXRE                   :1;
        unsigned                        :1;
        unsigned TXBE                   :1;
        unsigned                        :1;
        unsigned TXWE                   :1;
    };
    struct {
        unsigned SPI2RXBF               :1;
        unsigned                        :1;
        unsigned SPI2CLRBF              :1;
        unsigned SPI2RXRE               :1;
        unsigned                        :1;
        unsigned SPI2TXBE               :1;
        unsigned                        :1;
        unsigned SPI2TXWE               :1;
    };
} SPI2STATUSbits_t;
extern volatile SPI2STATUSbits_t SPI2STATUSbits __at(0x094);
// bitfield macros
#define _SPI2STATUS_RXBF_POSN                               0x0
#define _SPI2STATUS_RXBF_POSITION                           0x0
#define _SPI2STATUS_RXBF_SIZE                               0x1
#define _SPI2STATUS_RXBF_LENGTH                             0x1
#define _SPI2STATUS_RXBF_MASK                               0x1
#define _SPI2STATUS_CLRBF_POSN                              0x2
#define _SPI2STATUS_CLRBF_POSITION                          0x2
#define _SPI2STATUS_CLRBF_SIZE                              0x1
#define _SPI2STATUS_CLRBF_LENGTH                            0x1
#define _SPI2STATUS_CLRBF_MASK                              0x4
#define _SPI2STATUS_RXRE_POSN                               0x3
#define _SPI2STATUS_RXRE_POSITION                           0x3
#define _SPI2STATUS_RXRE_SIZE                               0x1
#define _SPI2STATUS_RXRE_LENGTH                             0x1
#define _SPI2STATUS_RXRE_MASK                               0x8
#define _SPI2STATUS_TXBE_POSN                               0x5
#define _SPI2STATUS_TXBE_POSITION                           0x5
#define _SPI2STATUS_TXBE_SIZE                               0x1
#define _SPI2STATUS_TXBE_LENGTH                             0x1
#define _SPI2STATUS_TXBE_MASK                               0x20
#define _SPI2STATUS_TXWE_POSN                               0x7
#define _SPI2STATUS_TXWE_POSITION                           0x7
#define _SPI2STATUS_TXWE_SIZE                               0x1
#define _SPI2STATUS_TXWE_LENGTH                             0x1
#define _SPI2STATUS_TXWE_MASK                               0x80
#define _SPI2STATUS_SPI2RXBF_POSN                           0x0
#define _SPI2STATUS_SPI2RXBF_POSITION                       0x0
#define _SPI2STATUS_SPI2RXBF_SIZE                           0x1
#define _SPI2STATUS_SPI2RXBF_LENGTH                         0x1
#define _SPI2STATUS_SPI2RXBF_MASK                           0x1
#define _SPI2STATUS_SPI2CLRBF_POSN                          0x2
#define _SPI2STATUS_SPI2CLRBF_POSITION                      0x2
#define _SPI2STATUS_SPI2CLRBF_SIZE                          0x1
#define _SPI2STATUS_SPI2CLRBF_LENGTH                        0x1
#define _SPI2STATUS_SPI2CLRBF_MASK                          0x4
#define _SPI2STATUS_SPI2RXRE_POSN                           0x3
#define _SPI2STATUS_SPI2RXRE_POSITION                       0x3
#define _SPI2STATUS_SPI2RXRE_SIZE                           0x1
#define _SPI2STATUS_SPI2RXRE_LENGTH                         0x1
#define _SPI2STATUS_SPI2RXRE_MASK                           0x8
#define _SPI2STATUS_SPI2TXBE_POSN                           0x5
#define _SPI2STATUS_SPI2TXBE_POSITION                       0x5
#define _SPI2STATUS_SPI2TXBE_SIZE                           0x1
#define _SPI2STATUS_SPI2TXBE_LENGTH                         0x1
#define _SPI2STATUS_SPI2TXBE_MASK                           0x20
#define _SPI2STATUS_SPI2TXWE_POSN                           0x7
#define _SPI2STATUS_SPI2TXWE_POSITION                       0x7
#define _SPI2STATUS_SPI2TXWE_SIZE                           0x1
#define _SPI2STATUS_SPI2TXWE_LENGTH                         0x1
#define _SPI2STATUS_SPI2TXWE_MASK                           0x80

// Register: SPI2TWIDTH
#define SPI2TWIDTH SPI2TWIDTH
extern volatile unsigned char           SPI2TWIDTH          __at(0x095);
#ifndef _LIB_BUILD
asm("SPI2TWIDTH equ 095h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TWIDTH                 :3;
    };
    struct {
        unsigned TWIDTH0                :1;
        unsigned TWIDTH1                :1;
        unsigned TWIDTH2                :1;
    };
} SPI2TWIDTHbits_t;
extern volatile SPI2TWIDTHbits_t SPI2TWIDTHbits __at(0x095);
// bitfield macros
#define _SPI2TWIDTH_TWIDTH_POSN                             0x0
#define _SPI2TWIDTH_TWIDTH_POSITION                         0x0
#define _SPI2TWIDTH_TWIDTH_SIZE                             0x3
#define _SPI2TWIDTH_TWIDTH_LENGTH                           0x3
#define _SPI2TWIDTH_TWIDTH_MASK                             0x7
#define _SPI2TWIDTH_TWIDTH0_POSN                            0x0
#define _SPI2TWIDTH_TWIDTH0_POSITION                        0x0
#define _SPI2TWIDTH_TWIDTH0_SIZE                            0x1
#define _SPI2TWIDTH_TWIDTH0_LENGTH                          0x1
#define _SPI2TWIDTH_TWIDTH0_MASK                            0x1
#define _SPI2TWIDTH_TWIDTH1_POSN                            0x1
#define _SPI2TWIDTH_TWIDTH1_POSITION                        0x1
#define _SPI2TWIDTH_TWIDTH1_SIZE                            0x1
#define _SPI2TWIDTH_TWIDTH1_LENGTH                          0x1
#define _SPI2TWIDTH_TWIDTH1_MASK                            0x2
#define _SPI2TWIDTH_TWIDTH2_POSN                            0x2
#define _SPI2TWIDTH_TWIDTH2_POSITION                        0x2
#define _SPI2TWIDTH_TWIDTH2_SIZE                            0x1
#define _SPI2TWIDTH_TWIDTH2_LENGTH                          0x1
#define _SPI2TWIDTH_TWIDTH2_MASK                            0x4

// Register: SPI2BAUD
#define SPI2BAUD SPI2BAUD
extern volatile unsigned char           SPI2BAUD            __at(0x096);
#ifndef _LIB_BUILD
asm("SPI2BAUD equ 096h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BAUD                   :8;
    };
    struct {
        unsigned BAUD0                  :1;
        unsigned BAUD1                  :1;
        unsigned BAUD2                  :1;
        unsigned BAUD3                  :1;
        unsigned BAUD4                  :1;
        unsigned BAUD5                  :1;
        unsigned BAUD6                  :1;
        unsigned BAUD7                  :1;
    };
} SPI2BAUDbits_t;
extern volatile SPI2BAUDbits_t SPI2BAUDbits __at(0x096);
// bitfield macros
#define _SPI2BAUD_BAUD_POSN                                 0x0
#define _SPI2BAUD_BAUD_POSITION                             0x0
#define _SPI2BAUD_BAUD_SIZE                                 0x8
#define _SPI2BAUD_BAUD_LENGTH                               0x8
#define _SPI2BAUD_BAUD_MASK                                 0xFF
#define _SPI2BAUD_BAUD0_POSN                                0x0
#define _SPI2BAUD_BAUD0_POSITION                            0x0
#define _SPI2BAUD_BAUD0_SIZE                                0x1
#define _SPI2BAUD_BAUD0_LENGTH                              0x1
#define _SPI2BAUD_BAUD0_MASK                                0x1
#define _SPI2BAUD_BAUD1_POSN                                0x1
#define _SPI2BAUD_BAUD1_POSITION                            0x1
#define _SPI2BAUD_BAUD1_SIZE                                0x1
#define _SPI2BAUD_BAUD1_LENGTH                              0x1
#define _SPI2BAUD_BAUD1_MASK                                0x2
#define _SPI2BAUD_BAUD2_POSN                                0x2
#define _SPI2BAUD_BAUD2_POSITION                            0x2
#define _SPI2BAUD_BAUD2_SIZE                                0x1
#define _SPI2BAUD_BAUD2_LENGTH                              0x1
#define _SPI2BAUD_BAUD2_MASK                                0x4
#define _SPI2BAUD_BAUD3_POSN                                0x3
#define _SPI2BAUD_BAUD3_POSITION                            0x3
#define _SPI2BAUD_BAUD3_SIZE                                0x1
#define _SPI2BAUD_BAUD3_LENGTH                              0x1
#define _SPI2BAUD_BAUD3_MASK                                0x8
#define _SPI2BAUD_BAUD4_POSN                                0x4
#define _SPI2BAUD_BAUD4_POSITION                            0x4
#define _SPI2BAUD_BAUD4_SIZE                                0x1
#define _SPI2BAUD_BAUD4_LENGTH                              0x1
#define _SPI2BAUD_BAUD4_MASK                                0x10
#define _SPI2BAUD_BAUD5_POSN                                0x5
#define _SPI2BAUD_BAUD5_POSITION                            0x5
#define _SPI2BAUD_BAUD5_SIZE                                0x1
#define _SPI2BAUD_BAUD5_LENGTH                              0x1
#define _SPI2BAUD_BAUD5_MASK                                0x20
#define _SPI2BAUD_BAUD6_POSN                                0x6
#define _SPI2BAUD_BAUD6_POSITION                            0x6
#define _SPI2BAUD_BAUD6_SIZE                                0x1
#define _SPI2BAUD_BAUD6_LENGTH                              0x1
#define _SPI2BAUD_BAUD6_MASK                                0x40
#define _SPI2BAUD_BAUD7_POSN                                0x7
#define _SPI2BAUD_BAUD7_POSITION                            0x7
#define _SPI2BAUD_BAUD7_SIZE                                0x1
#define _SPI2BAUD_BAUD7_LENGTH                              0x1
#define _SPI2BAUD_BAUD7_MASK                                0x80

