GopalSaraf/Practicals/PSDL/include/proc/pic18f15q41.h
// Register: DMAnSCNT
#define DMAnSCNT DMAnSCNT
extern volatile unsigned short          DMAnSCNT            __at(0x0F2);
#ifndef _LIB_BUILD
asm("DMAnSCNT equ 0F2h");
#endif

// Register: DMAnSCNTL
#define DMAnSCNTL DMAnSCNTL
extern volatile unsigned char           DMAnSCNTL           __at(0x0F2);
#ifndef _LIB_BUILD
asm("DMAnSCNTL equ 0F2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SCNT                   :8;
    };
    struct {
        unsigned SCNT0                  :1;
        unsigned SCNT1                  :1;
        unsigned SCNT2                  :1;
        unsigned SCNT3                  :1;
        unsigned SCNT4                  :1;
        unsigned SCNT5                  :1;
        unsigned SCNT6                  :1;
        unsigned SCNT7                  :1;
    };
} DMAnSCNTLbits_t;
extern volatile DMAnSCNTLbits_t DMAnSCNTLbits __at(0x0F2);
// bitfield macros
#define _DMAnSCNTL_SCNT_POSN                                0x0
#define _DMAnSCNTL_SCNT_POSITION                            0x0
#define _DMAnSCNTL_SCNT_SIZE                                0x8
#define _DMAnSCNTL_SCNT_LENGTH                              0x8
#define _DMAnSCNTL_SCNT_MASK                                0xFF
#define _DMAnSCNTL_SCNT0_POSN                               0x0
#define _DMAnSCNTL_SCNT0_POSITION                           0x0
#define _DMAnSCNTL_SCNT0_SIZE                               0x1
#define _DMAnSCNTL_SCNT0_LENGTH                             0x1
#define _DMAnSCNTL_SCNT0_MASK                               0x1
#define _DMAnSCNTL_SCNT1_POSN                               0x1
#define _DMAnSCNTL_SCNT1_POSITION                           0x1
#define _DMAnSCNTL_SCNT1_SIZE                               0x1
#define _DMAnSCNTL_SCNT1_LENGTH                             0x1
#define _DMAnSCNTL_SCNT1_MASK                               0x2
#define _DMAnSCNTL_SCNT2_POSN                               0x2
#define _DMAnSCNTL_SCNT2_POSITION                           0x2
#define _DMAnSCNTL_SCNT2_SIZE                               0x1
#define _DMAnSCNTL_SCNT2_LENGTH                             0x1
#define _DMAnSCNTL_SCNT2_MASK                               0x4
#define _DMAnSCNTL_SCNT3_POSN                               0x3
#define _DMAnSCNTL_SCNT3_POSITION                           0x3
#define _DMAnSCNTL_SCNT3_SIZE                               0x1
#define _DMAnSCNTL_SCNT3_LENGTH                             0x1
#define _DMAnSCNTL_SCNT3_MASK                               0x8
#define _DMAnSCNTL_SCNT4_POSN                               0x4
#define _DMAnSCNTL_SCNT4_POSITION                           0x4
#define _DMAnSCNTL_SCNT4_SIZE                               0x1
#define _DMAnSCNTL_SCNT4_LENGTH                             0x1
#define _DMAnSCNTL_SCNT4_MASK                               0x10
#define _DMAnSCNTL_SCNT5_POSN                               0x5
#define _DMAnSCNTL_SCNT5_POSITION                           0x5
#define _DMAnSCNTL_SCNT5_SIZE                               0x1
#define _DMAnSCNTL_SCNT5_LENGTH                             0x1
#define _DMAnSCNTL_SCNT5_MASK                               0x20
#define _DMAnSCNTL_SCNT6_POSN                               0x6
#define _DMAnSCNTL_SCNT6_POSITION                           0x6
#define _DMAnSCNTL_SCNT6_SIZE                               0x1
#define _DMAnSCNTL_SCNT6_LENGTH                             0x1
#define _DMAnSCNTL_SCNT6_MASK                               0x40
#define _DMAnSCNTL_SCNT7_POSN                               0x7
#define _DMAnSCNTL_SCNT7_POSITION                           0x7
#define _DMAnSCNTL_SCNT7_SIZE                               0x1
#define _DMAnSCNTL_SCNT7_LENGTH                             0x1
#define _DMAnSCNTL_SCNT7_MASK                               0x80

// Register: DMAnSCNTH
#define DMAnSCNTH DMAnSCNTH
extern volatile unsigned char           DMAnSCNTH           __at(0x0F3);
#ifndef _LIB_BUILD
asm("DMAnSCNTH equ 0F3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SCNT                   :8;
    };
    struct {
        unsigned SCNT8                  :1;
        unsigned SCNT9                  :1;
        unsigned SCNT10                 :1;
        unsigned SCNT11                 :1;
    };
} DMAnSCNTHbits_t;
extern volatile DMAnSCNTHbits_t DMAnSCNTHbits __at(0x0F3);
// bitfield macros
#define _DMAnSCNTH_SCNT_POSN                                0x0
#define _DMAnSCNTH_SCNT_POSITION                            0x0
#define _DMAnSCNTH_SCNT_SIZE                                0x8
#define _DMAnSCNTH_SCNT_LENGTH                              0x8
#define _DMAnSCNTH_SCNT_MASK                                0xFF
#define _DMAnSCNTH_SCNT8_POSN                               0x0
#define _DMAnSCNTH_SCNT8_POSITION                           0x0
#define _DMAnSCNTH_SCNT8_SIZE                               0x1
#define _DMAnSCNTH_SCNT8_LENGTH                             0x1
#define _DMAnSCNTH_SCNT8_MASK                               0x1
#define _DMAnSCNTH_SCNT9_POSN                               0x1
#define _DMAnSCNTH_SCNT9_POSITION                           0x1
#define _DMAnSCNTH_SCNT9_SIZE                               0x1
#define _DMAnSCNTH_SCNT9_LENGTH                             0x1
#define _DMAnSCNTH_SCNT9_MASK                               0x2
#define _DMAnSCNTH_SCNT10_POSN                              0x2
#define _DMAnSCNTH_SCNT10_POSITION                          0x2
#define _DMAnSCNTH_SCNT10_SIZE                              0x1
#define _DMAnSCNTH_SCNT10_LENGTH                            0x1
#define _DMAnSCNTH_SCNT10_MASK                              0x4
#define _DMAnSCNTH_SCNT11_POSN                              0x3
#define _DMAnSCNTH_SCNT11_POSITION                          0x3
#define _DMAnSCNTH_SCNT11_SIZE                              0x1
#define _DMAnSCNTH_SCNT11_LENGTH                            0x1
#define _DMAnSCNTH_SCNT11_MASK                              0x8

// Register: DMAnSPTR
#define DMAnSPTR DMAnSPTR
#ifndef __CCI__
extern volatile __uint24                DMAnSPTR            __at(0x0F4);
#endif
#ifndef _LIB_BUILD
asm("DMAnSPTR equ 0F4h");
#endif

// Register: DMAnSPTRL
#define DMAnSPTRL DMAnSPTRL
extern volatile unsigned char           DMAnSPTRL           __at(0x0F4);
#ifndef _LIB_BUILD
asm("DMAnSPTRL equ 0F4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPTR                   :8;
    };
    struct {
        unsigned SPTR0                  :1;
        unsigned SPTR1                  :1;
        unsigned SPTR2                  :1;
        unsigned SPTR3                  :1;
        unsigned SPTR4                  :1;
        unsigned SPTR5                  :1;
        unsigned SPTR6                  :1;
        unsigned SPTR7                  :1;
    };
} DMAnSPTRLbits_t;
extern volatile DMAnSPTRLbits_t DMAnSPTRLbits __at(0x0F4);
// bitfield macros
#define _DMAnSPTRL_SPTR_POSN                                0x0
#define _DMAnSPTRL_SPTR_POSITION                            0x0
#define _DMAnSPTRL_SPTR_SIZE                                0x8
#define _DMAnSPTRL_SPTR_LENGTH                              0x8
#define _DMAnSPTRL_SPTR_MASK                                0xFF
#define _DMAnSPTRL_SPTR0_POSN                               0x0
#define _DMAnSPTRL_SPTR0_POSITION                           0x0
#define _DMAnSPTRL_SPTR0_SIZE                               0x1
#define _DMAnSPTRL_SPTR0_LENGTH                             0x1
#define _DMAnSPTRL_SPTR0_MASK                               0x1
#define _DMAnSPTRL_SPTR1_POSN                               0x1
#define _DMAnSPTRL_SPTR1_POSITION                           0x1
#define _DMAnSPTRL_SPTR1_SIZE                               0x1
#define _DMAnSPTRL_SPTR1_LENGTH                             0x1
#define _DMAnSPTRL_SPTR1_MASK                               0x2
#define _DMAnSPTRL_SPTR2_POSN                               0x2
#define _DMAnSPTRL_SPTR2_POSITION                           0x2
#define _DMAnSPTRL_SPTR2_SIZE                               0x1
#define _DMAnSPTRL_SPTR2_LENGTH                             0x1
#define _DMAnSPTRL_SPTR2_MASK                               0x4
#define _DMAnSPTRL_SPTR3_POSN                               0x3
#define _DMAnSPTRL_SPTR3_POSITION                           0x3
#define _DMAnSPTRL_SPTR3_SIZE                               0x1
#define _DMAnSPTRL_SPTR3_LENGTH                             0x1
#define _DMAnSPTRL_SPTR3_MASK                               0x8
#define _DMAnSPTRL_SPTR4_POSN                               0x4
#define _DMAnSPTRL_SPTR4_POSITION                           0x4
#define _DMAnSPTRL_SPTR4_SIZE                               0x1
#define _DMAnSPTRL_SPTR4_LENGTH                             0x1
#define _DMAnSPTRL_SPTR4_MASK                               0x10
#define _DMAnSPTRL_SPTR5_POSN                               0x5
#define _DMAnSPTRL_SPTR5_POSITION                           0x5
#define _DMAnSPTRL_SPTR5_SIZE                               0x1
#define _DMAnSPTRL_SPTR5_LENGTH                             0x1
#define _DMAnSPTRL_SPTR5_MASK                               0x20
#define _DMAnSPTRL_SPTR6_POSN                               0x6
#define _DMAnSPTRL_SPTR6_POSITION                           0x6
#define _DMAnSPTRL_SPTR6_SIZE                               0x1
#define _DMAnSPTRL_SPTR6_LENGTH                             0x1
#define _DMAnSPTRL_SPTR6_MASK                               0x40
#define _DMAnSPTRL_SPTR7_POSN                               0x7
#define _DMAnSPTRL_SPTR7_POSITION                           0x7
#define _DMAnSPTRL_SPTR7_SIZE                               0x1
#define _DMAnSPTRL_SPTR7_LENGTH                             0x1
#define _DMAnSPTRL_SPTR7_MASK                               0x80

// Register: DMAnSPTRH
#define DMAnSPTRH DMAnSPTRH
extern volatile unsigned char           DMAnSPTRH           __at(0x0F5);
#ifndef _LIB_BUILD
asm("DMAnSPTRH equ 0F5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPTR                   :8;
    };
    struct {
        unsigned SPTR8                  :1;
        unsigned SPTR9                  :1;
        unsigned SPTR10                 :1;
        unsigned SPTR11                 :1;
        unsigned SPTR12                 :1;
        unsigned SPTR13                 :1;
        unsigned SPTR14                 :1;
        unsigned SPTR15                 :1;
    };
} DMAnSPTRHbits_t;
extern volatile DMAnSPTRHbits_t DMAnSPTRHbits __at(0x0F5);
// bitfield macros
#define _DMAnSPTRH_SPTR_POSN                                0x0
#define _DMAnSPTRH_SPTR_POSITION                            0x0
#define _DMAnSPTRH_SPTR_SIZE                                0x8
#define _DMAnSPTRH_SPTR_LENGTH                              0x8
#define _DMAnSPTRH_SPTR_MASK                                0xFF
#define _DMAnSPTRH_SPTR8_POSN                               0x0
#define _DMAnSPTRH_SPTR8_POSITION                           0x0
#define _DMAnSPTRH_SPTR8_SIZE                               0x1
#define _DMAnSPTRH_SPTR8_LENGTH                             0x1
#define _DMAnSPTRH_SPTR8_MASK                               0x1
#define _DMAnSPTRH_SPTR9_POSN                               0x1
#define _DMAnSPTRH_SPTR9_POSITION                           0x1
#define _DMAnSPTRH_SPTR9_SIZE                               0x1
#define _DMAnSPTRH_SPTR9_LENGTH                             0x1
#define _DMAnSPTRH_SPTR9_MASK                               0x2
#define _DMAnSPTRH_SPTR10_POSN                              0x2
#define _DMAnSPTRH_SPTR10_POSITION                          0x2
#define _DMAnSPTRH_SPTR10_SIZE                              0x1
#define _DMAnSPTRH_SPTR10_LENGTH                            0x1
#define _DMAnSPTRH_SPTR10_MASK                              0x4
#define _DMAnSPTRH_SPTR11_POSN                              0x3
#define _DMAnSPTRH_SPTR11_POSITION                          0x3
#define _DMAnSPTRH_SPTR11_SIZE                              0x1
#define _DMAnSPTRH_SPTR11_LENGTH                            0x1
#define _DMAnSPTRH_SPTR11_MASK                              0x8
#define _DMAnSPTRH_SPTR12_POSN                              0x4
#define _DMAnSPTRH_SPTR12_POSITION                          0x4
#define _DMAnSPTRH_SPTR12_SIZE                              0x1
#define _DMAnSPTRH_SPTR12_LENGTH                            0x1
#define _DMAnSPTRH_SPTR12_MASK                              0x10
#define _DMAnSPTRH_SPTR13_POSN                              0x5
#define _DMAnSPTRH_SPTR13_POSITION                          0x5
#define _DMAnSPTRH_SPTR13_SIZE                              0x1
#define _DMAnSPTRH_SPTR13_LENGTH                            0x1
#define _DMAnSPTRH_SPTR13_MASK                              0x20
#define _DMAnSPTRH_SPTR14_POSN                              0x6
#define _DMAnSPTRH_SPTR14_POSITION                          0x6
#define _DMAnSPTRH_SPTR14_SIZE                              0x1
#define _DMAnSPTRH_SPTR14_LENGTH                            0x1
#define _DMAnSPTRH_SPTR14_MASK                              0x40
#define _DMAnSPTRH_SPTR15_POSN                              0x7
#define _DMAnSPTRH_SPTR15_POSITION                          0x7
#define _DMAnSPTRH_SPTR15_SIZE                              0x1
#define _DMAnSPTRH_SPTR15_LENGTH                            0x1
#define _DMAnSPTRH_SPTR15_MASK                              0x80

// Register: DMAnSPTRU
#define DMAnSPTRU DMAnSPTRU
extern volatile unsigned char           DMAnSPTRU           __at(0x0F6);
#ifndef _LIB_BUILD
asm("DMAnSPTRU equ 0F6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPTR                   :8;
    };
    struct {
        unsigned SPTR16                 :1;
        unsigned SPTR17                 :1;
        unsigned SPTR18                 :1;
        unsigned SPTR19                 :1;
        unsigned SPTR20                 :1;
        unsigned SPTR21                 :1;
    };
} DMAnSPTRUbits_t;
