GopalSaraf/Practicals/PSDL/include/proc/pic18f15q41.h
extern volatile IPR2bits_t IPR2bits __at(0x369);
// bitfield macros
#define _IPR2_ADTIP_POSN                                    0x0
#define _IPR2_ADTIP_POSITION                                0x0
#define _IPR2_ADTIP_SIZE                                    0x1
#define _IPR2_ADTIP_LENGTH                                  0x1
#define _IPR2_ADTIP_MASK                                    0x1
#define _IPR2_DMA1SCNTIP_POSN                               0x4
#define _IPR2_DMA1SCNTIP_POSITION                           0x4
#define _IPR2_DMA1SCNTIP_SIZE                               0x1
#define _IPR2_DMA1SCNTIP_LENGTH                             0x1
#define _IPR2_DMA1SCNTIP_MASK                               0x10
#define _IPR2_DMA1DCNTIP_POSN                               0x5
#define _IPR2_DMA1DCNTIP_POSITION                           0x5
#define _IPR2_DMA1DCNTIP_SIZE                               0x1
#define _IPR2_DMA1DCNTIP_LENGTH                             0x1
#define _IPR2_DMA1DCNTIP_MASK                               0x20
#define _IPR2_DMA1ORIP_POSN                                 0x6
#define _IPR2_DMA1ORIP_POSITION                             0x6
#define _IPR2_DMA1ORIP_SIZE                                 0x1
#define _IPR2_DMA1ORIP_LENGTH                               0x1
#define _IPR2_DMA1ORIP_MASK                                 0x40
#define _IPR2_DMA1AIP_POSN                                  0x7
#define _IPR2_DMA1AIP_POSITION                              0x7
#define _IPR2_DMA1AIP_SIZE                                  0x1
#define _IPR2_DMA1AIP_LENGTH                                0x1
#define _IPR2_DMA1AIP_MASK                                  0x80

// Register: IPR3
#define IPR3 IPR3
extern volatile unsigned char           IPR3                __at(0x36A);
#ifndef _LIB_BUILD
asm("IPR3 equ 036Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPI1RXIP               :1;
        unsigned SPI1TXIP               :1;
        unsigned SPI1IP                 :1;
        unsigned TMR2IP                 :1;
        unsigned TMR1IP                 :1;
        unsigned TMR1GIP                :1;
        unsigned CCP1IP                 :1;
        unsigned TMR0IP                 :1;
    };
} IPR3bits_t;
extern volatile IPR3bits_t IPR3bits __at(0x36A);
// bitfield macros
#define _IPR3_SPI1RXIP_POSN                                 0x0
#define _IPR3_SPI1RXIP_POSITION                             0x0
#define _IPR3_SPI1RXIP_SIZE                                 0x1
#define _IPR3_SPI1RXIP_LENGTH                               0x1
#define _IPR3_SPI1RXIP_MASK                                 0x1
#define _IPR3_SPI1TXIP_POSN                                 0x1
#define _IPR3_SPI1TXIP_POSITION                             0x1
#define _IPR3_SPI1TXIP_SIZE                                 0x1
#define _IPR3_SPI1TXIP_LENGTH                               0x1
#define _IPR3_SPI1TXIP_MASK                                 0x2
#define _IPR3_SPI1IP_POSN                                   0x2
#define _IPR3_SPI1IP_POSITION                               0x2
#define _IPR3_SPI1IP_SIZE                                   0x1
#define _IPR3_SPI1IP_LENGTH                                 0x1
#define _IPR3_SPI1IP_MASK                                   0x4
#define _IPR3_TMR2IP_POSN                                   0x3
#define _IPR3_TMR2IP_POSITION                               0x3
#define _IPR3_TMR2IP_SIZE                                   0x1
#define _IPR3_TMR2IP_LENGTH                                 0x1
#define _IPR3_TMR2IP_MASK                                   0x8
#define _IPR3_TMR1IP_POSN                                   0x4
#define _IPR3_TMR1IP_POSITION                               0x4
#define _IPR3_TMR1IP_SIZE                                   0x1
#define _IPR3_TMR1IP_LENGTH                                 0x1
#define _IPR3_TMR1IP_MASK                                   0x10
#define _IPR3_TMR1GIP_POSN                                  0x5
#define _IPR3_TMR1GIP_POSITION                              0x5
#define _IPR3_TMR1GIP_SIZE                                  0x1
#define _IPR3_TMR1GIP_LENGTH                                0x1
#define _IPR3_TMR1GIP_MASK                                  0x20
#define _IPR3_CCP1IP_POSN                                   0x6
#define _IPR3_CCP1IP_POSITION                               0x6
#define _IPR3_CCP1IP_SIZE                                   0x1
#define _IPR3_CCP1IP_LENGTH                                 0x1
#define _IPR3_CCP1IP_MASK                                   0x40
#define _IPR3_TMR0IP_POSN                                   0x7
#define _IPR3_TMR0IP_POSITION                               0x7
#define _IPR3_TMR0IP_SIZE                                   0x1
#define _IPR3_TMR0IP_LENGTH                                 0x1
#define _IPR3_TMR0IP_MASK                                   0x80

// Register: IPR4
#define IPR4 IPR4
extern volatile unsigned char           IPR4                __at(0x36B);
#ifndef _LIB_BUILD
asm("IPR4 equ 036Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned U1RXIP                 :1;
        unsigned U1TXIP                 :1;
        unsigned U1EIP                  :1;
        unsigned U1IP                   :1;
        unsigned TMR3IP                 :1;
        unsigned TMR3GIP                :1;
        unsigned PWM1PIP                :1;
        unsigned PWM1IP                 :1;
    };
} IPR4bits_t;
extern volatile IPR4bits_t IPR4bits __at(0x36B);
// bitfield macros
#define _IPR4_U1RXIP_POSN                                   0x0
#define _IPR4_U1RXIP_POSITION                               0x0
#define _IPR4_U1RXIP_SIZE                                   0x1
#define _IPR4_U1RXIP_LENGTH                                 0x1
#define _IPR4_U1RXIP_MASK                                   0x1
#define _IPR4_U1TXIP_POSN                                   0x1
#define _IPR4_U1TXIP_POSITION                               0x1
#define _IPR4_U1TXIP_SIZE                                   0x1
#define _IPR4_U1TXIP_LENGTH                                 0x1
#define _IPR4_U1TXIP_MASK                                   0x2
#define _IPR4_U1EIP_POSN                                    0x2
#define _IPR4_U1EIP_POSITION                                0x2
#define _IPR4_U1EIP_SIZE                                    0x1
#define _IPR4_U1EIP_LENGTH                                  0x1
#define _IPR4_U1EIP_MASK                                    0x4
#define _IPR4_U1IP_POSN                                     0x3
#define _IPR4_U1IP_POSITION                                 0x3
#define _IPR4_U1IP_SIZE                                     0x1
#define _IPR4_U1IP_LENGTH                                   0x1
#define _IPR4_U1IP_MASK                                     0x8
#define _IPR4_TMR3IP_POSN                                   0x4
#define _IPR4_TMR3IP_POSITION                               0x4
#define _IPR4_TMR3IP_SIZE                                   0x1
#define _IPR4_TMR3IP_LENGTH                                 0x1
#define _IPR4_TMR3IP_MASK                                   0x10
#define _IPR4_TMR3GIP_POSN                                  0x5
#define _IPR4_TMR3GIP_POSITION                              0x5
#define _IPR4_TMR3GIP_SIZE                                  0x1
#define _IPR4_TMR3GIP_LENGTH                                0x1
#define _IPR4_TMR3GIP_MASK                                  0x20
#define _IPR4_PWM1PIP_POSN                                  0x6
#define _IPR4_PWM1PIP_POSITION                              0x6
#define _IPR4_PWM1PIP_SIZE                                  0x1
#define _IPR4_PWM1PIP_LENGTH                                0x1
#define _IPR4_PWM1PIP_MASK                                  0x40
#define _IPR4_PWM1IP_POSN                                   0x7
#define _IPR4_PWM1IP_POSITION                               0x7
#define _IPR4_PWM1IP_SIZE                                   0x1
#define _IPR4_PWM1IP_LENGTH                                 0x1
#define _IPR4_PWM1IP_MASK                                   0x80

// Register: IPR5
#define IPR5 IPR5
extern volatile unsigned char           IPR5                __at(0x36C);
#ifndef _LIB_BUILD
asm("IPR5 equ 036Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPI2RXIP               :1;
        unsigned SPI2TXIP               :1;
        unsigned SPI2IP                 :1;
        unsigned                        :1;
        unsigned C2IP                   :1;
        unsigned CLC2IP                 :1;
        unsigned PWM2PIP                :1;
        unsigned PWM2IP                 :1;
    };
    struct {
        unsigned                        :4;
        unsigned CM2IP                  :1;
    };
} IPR5bits_t;
extern volatile IPR5bits_t IPR5bits __at(0x36C);
// bitfield macros
#define _IPR5_SPI2RXIP_POSN                                 0x0
#define _IPR5_SPI2RXIP_POSITION                             0x0
#define _IPR5_SPI2RXIP_SIZE                                 0x1
#define _IPR5_SPI2RXIP_LENGTH                               0x1
#define _IPR5_SPI2RXIP_MASK                                 0x1
#define _IPR5_SPI2TXIP_POSN                                 0x1
#define _IPR5_SPI2TXIP_POSITION                             0x1
#define _IPR5_SPI2TXIP_SIZE                                 0x1
#define _IPR5_SPI2TXIP_LENGTH                               0x1
#define _IPR5_SPI2TXIP_MASK                                 0x2
#define _IPR5_SPI2IP_POSN                                   0x2
#define _IPR5_SPI2IP_POSITION                               0x2
#define _IPR5_SPI2IP_SIZE                                   0x1
#define _IPR5_SPI2IP_LENGTH                                 0x1
#define _IPR5_SPI2IP_MASK                                   0x4
#define _IPR5_C2IP_POSN                                     0x4
#define _IPR5_C2IP_POSITION                                 0x4
#define _IPR5_C2IP_SIZE                                     0x1
#define _IPR5_C2IP_LENGTH                                   0x1
#define _IPR5_C2IP_MASK                                     0x10
#define _IPR5_CLC2IP_POSN                                   0x5
#define _IPR5_CLC2IP_POSITION                               0x5
#define _IPR5_CLC2IP_SIZE                                   0x1
#define _IPR5_CLC2IP_LENGTH                                 0x1
#define _IPR5_CLC2IP_MASK                                   0x20
#define _IPR5_PWM2PIP_POSN                                  0x6
#define _IPR5_PWM2PIP_POSITION                              0x6
#define _IPR5_PWM2PIP_SIZE                                  0x1
#define _IPR5_PWM2PIP_LENGTH                                0x1
#define _IPR5_PWM2PIP_MASK                                  0x40
#define _IPR5_PWM2IP_POSN                                   0x7
#define _IPR5_PWM2IP_POSITION                               0x7
#define _IPR5_PWM2IP_SIZE                                   0x1
#define _IPR5_PWM2IP_LENGTH                                 0x1
#define _IPR5_PWM2IP_MASK                                   0x80
#define _IPR5_CM2IP_POSN                                    0x4
#define _IPR5_CM2IP_POSITION                                0x4
#define _IPR5_CM2IP_SIZE                                    0x1
#define _IPR5_CM2IP_LENGTH                                  0x1
#define _IPR5_CM2IP_MASK                                    0x10

