GopalSaraf/Practicals/PSDL/include/proc/pic18f15q41.h
#define                                 BFRET0_bit          _BIT_ACCESS(I2C1CON2,0)
// I2C1CON2<BFRET1>
extern volatile __bit                   BFRET1              __at(0x14B1);	// @ (0x296 * 8 + 1)
#define                                 BFRET1_bit          _BIT_ACCESS(I2C1CON2,1)
// MD1CON0<BIT>
extern volatile __bit                   BIT                 __at(0x350);	// @ (0x6A * 8 + 0)
#define                                 BIT_bit             _BIT_ACCESS(MD1CON0,0)
// PCON0<BOR>
extern volatile __bit                   BOR                 __at(0x2780);	// @ (0x4F0 * 8 + 0)
#define                                 BOR_bit             _BIT_ACCESS(PCON0,0)
// BORCON<BORRDY>
extern volatile __bit                   BORRDY              __at(0x248);	// @ (0x49 * 8 + 0)
#define                                 BORRDY_bit          _BIT_ACCESS(BORCON,0)
// I2C1ERR<BTO1IE>
extern volatile __bit                   BTO1IE              __at(0x14BA);	// @ (0x297 * 8 + 2)
#define                                 BTO1IE_bit          _BIT_ACCESS(I2C1ERR,2)
// I2C1ERR<BTO1IF>
extern volatile __bit                   BTO1IF              __at(0x14BE);	// @ (0x297 * 8 + 6)
#define                                 BTO1IF_bit          _BIT_ACCESS(I2C1ERR,6)
// I2C1BTOC<BTOC0>
extern volatile __bit                   BTOC0               __at(0x14F8);	// @ (0x29F * 8 + 0)
#define                                 BTOC0_bit           _BIT_ACCESS(I2C1BTOC,0)
// I2C1BTOC<BTOC1>
extern volatile __bit                   BTOC1               __at(0x14F9);	// @ (0x29F * 8 + 1)
#define                                 BTOC1_bit           _BIT_ACCESS(I2C1BTOC,1)
// I2C1BTOC<BTOC2>
extern volatile __bit                   BTOC2               __at(0x14FA);	// @ (0x29F * 8 + 2)
#define                                 BTOC2_bit           _BIT_ACCESS(I2C1BTOC,2)
// I2C1BTOC<BTOC3>
extern volatile __bit                   BTOC3               __at(0x14FB);	// @ (0x29F * 8 + 3)
#define                                 BTOC3_bit           _BIT_ACCESS(I2C1BTOC,3)
// I2C1ERR<BTOIE>
extern volatile __bit                   BTOIE               __at(0x14BA);	// @ (0x297 * 8 + 2)
#define                                 BTOIE_bit           _BIT_ACCESS(I2C1ERR,2)
// I2C1ERR<BTOIF>
extern volatile __bit                   BTOIF               __at(0x14BE);	// @ (0x297 * 8 + 6)
#define                                 BTOIF_bit           _BIT_ACCESS(I2C1ERR,6)
// DMAnBUF<BUF0>
extern volatile __bit                   BUF0                __at(0x748);	// @ (0xE9 * 8 + 0)
#define                                 BUF0_bit            _BIT_ACCESS(DMAnBUF,0)
// DMAnBUF<BUF1>
extern volatile __bit                   BUF1                __at(0x749);	// @ (0xE9 * 8 + 1)
#define                                 BUF1_bit            _BIT_ACCESS(DMAnBUF,1)
// DMAnBUF<BUF2>
extern volatile __bit                   BUF2                __at(0x74A);	// @ (0xE9 * 8 + 2)
#define                                 BUF2_bit            _BIT_ACCESS(DMAnBUF,2)
// DMAnBUF<BUF3>
extern volatile __bit                   BUF3                __at(0x74B);	// @ (0xE9 * 8 + 3)
#define                                 BUF3_bit            _BIT_ACCESS(DMAnBUF,3)
// DMAnBUF<BUF4>
extern volatile __bit                   BUF4                __at(0x74C);	// @ (0xE9 * 8 + 4)
#define                                 BUF4_bit            _BIT_ACCESS(DMAnBUF,4)
// DMAnBUF<BUF5>
extern volatile __bit                   BUF5                __at(0x74D);	// @ (0xE9 * 8 + 5)
#define                                 BUF5_bit            _BIT_ACCESS(DMAnBUF,5)
// DMAnBUF<BUF6>
extern volatile __bit                   BUF6                __at(0x74E);	// @ (0xE9 * 8 + 6)
#define                                 BUF6_bit            _BIT_ACCESS(DMAnBUF,6)
// DMAnBUF<BUF7>
extern volatile __bit                   BUF7                __at(0x74F);	// @ (0xE9 * 8 + 7)
#define                                 BUF7_bit            _BIT_ACCESS(DMAnBUF,7)
// SCANCON0<BURSTMD>
extern volatile __bit                   BURSTMD             __at(0x1B01);	// @ (0x360 * 8 + 1)
#define                                 BURSTMD_bit         _BIT_ACCESS(SCANCON0,1)
// U1CON2<C0EN>
extern volatile __bit                   C0EN                __at(0x156B);	// @ (0x2AD * 8 + 3)
#define                                 C0EN_bit            _BIT_ACCESS(U1CON2,3)
// CM1CON0<C1EN>
extern volatile __bit                   C1EN                __at(0x387);	// @ (0x70 * 8 + 7)
#define                                 C1EN_bit            _BIT_ACCESS(CM1CON0,7)
// CM1CON0<C1HYS>
extern volatile __bit                   C1HYS               __at(0x381);	// @ (0x70 * 8 + 1)
#define                                 C1HYS_bit           _BIT_ACCESS(CM1CON0,1)
// PIE1<C1IE>
extern volatile __bit                   C1IE                __at(0x254C);	// @ (0x4A9 * 8 + 4)
#define                                 C1IE_bit            _BIT_ACCESS(PIE1,4)
// PIR1<C1IF>
extern volatile __bit                   C1IF                __at(0x25A4);	// @ (0x4B4 * 8 + 4)
#define                                 C1IF_bit            _BIT_ACCESS(PIR1,4)
// CM1CON1<C1INTN>
extern volatile __bit                   C1INTN              __at(0x388);	// @ (0x71 * 8 + 0)
#define                                 C1INTN_bit          _BIT_ACCESS(CM1CON1,0)
// CM1CON1<C1INTP>
extern volatile __bit                   C1INTP              __at(0x389);	// @ (0x71 * 8 + 1)
#define                                 C1INTP_bit          _BIT_ACCESS(CM1CON1,1)
// IPR1<C1IP>
extern volatile __bit                   C1IP                __at(0x1B44);	// @ (0x368 * 8 + 4)
#define                                 C1IP_bit            _BIT_ACCESS(IPR1,4)
// CM1NCH<C1NCH0>
extern volatile __bit                   C1NCH0              __at(0x390);	// @ (0x72 * 8 + 0)
#define                                 C1NCH0_bit          _BIT_ACCESS(CM1NCH,0)
// CM1NCH<C1NCH1>
extern volatile __bit                   C1NCH1              __at(0x391);	// @ (0x72 * 8 + 1)
#define                                 C1NCH1_bit          _BIT_ACCESS(CM1NCH,1)
// CM1NCH<C1NCH2>
extern volatile __bit                   C1NCH2              __at(0x392);	// @ (0x72 * 8 + 2)
#define                                 C1NCH2_bit          _BIT_ACCESS(CM1NCH,2)
// CM1CON0<C1OUT>
extern volatile __bit                   C1OUT               __at(0x386);	// @ (0x70 * 8 + 6)
#define                                 C1OUT_bit           _BIT_ACCESS(CM1CON0,6)
// CM1PCH<C1PCH0>
extern volatile __bit                   C1PCH0              __at(0x398);	// @ (0x73 * 8 + 0)
#define                                 C1PCH0_bit          _BIT_ACCESS(CM1PCH,0)
// CM1PCH<C1PCH1>
extern volatile __bit                   C1PCH1              __at(0x399);	// @ (0x73 * 8 + 1)
#define                                 C1PCH1_bit          _BIT_ACCESS(CM1PCH,1)
// CM1PCH<C1PCH2>
extern volatile __bit                   C1PCH2              __at(0x39A);	// @ (0x73 * 8 + 2)
#define                                 C1PCH2_bit          _BIT_ACCESS(CM1PCH,2)
// CM1CON0<C1POL>
extern volatile __bit                   C1POL               __at(0x384);	// @ (0x70 * 8 + 4)
#define                                 C1POL_bit           _BIT_ACCESS(CM1CON0,4)
// CM1CON0<C1SYNC>
extern volatile __bit                   C1SYNC              __at(0x380);	// @ (0x70 * 8 + 0)
#define                                 C1SYNC_bit          _BIT_ACCESS(CM1CON0,0)
// CCPTMRS0<C1TSEL0>
extern volatile __bit                   C1TSEL0             __at(0x1A60);	// @ (0x34C * 8 + 0)
#define                                 C1TSEL0_bit         _BIT_ACCESS(CCPTMRS0,0)
// CCPTMRS0<C1TSEL1>
extern volatile __bit                   C1TSEL1             __at(0x1A61);	// @ (0x34C * 8 + 1)
#define                                 C1TSEL1_bit         _BIT_ACCESS(CCPTMRS0,1)
// CM2CON0<C2EN>
extern volatile __bit                   C2EN                __at(0x3A7);	// @ (0x74 * 8 + 7)
#define                                 C2EN_bit            _BIT_ACCESS(CM2CON0,7)
// CM2CON0<C2HYS>
extern volatile __bit                   C2HYS               __at(0x3A1);	// @ (0x74 * 8 + 1)
#define                                 C2HYS_bit           _BIT_ACCESS(CM2CON0,1)
// PIE5<C2IE>
extern volatile __bit                   C2IE                __at(0x256C);	// @ (0x4AD * 8 + 4)
#define                                 C2IE_bit            _BIT_ACCESS(PIE5,4)
// PIR5<C2IF>
extern volatile __bit                   C2IF                __at(0x25C4);	// @ (0x4B8 * 8 + 4)
#define                                 C2IF_bit            _BIT_ACCESS(PIR5,4)
// CM2CON1<C2INTN>
extern volatile __bit                   C2INTN              __at(0x3A8);	// @ (0x75 * 8 + 0)
#define                                 C2INTN_bit          _BIT_ACCESS(CM2CON1,0)
// CM2CON1<C2INTP>
extern volatile __bit                   C2INTP              __at(0x3A9);	// @ (0x75 * 8 + 1)
#define                                 C2INTP_bit          _BIT_ACCESS(CM2CON1,1)
// IPR5<C2IP>
extern volatile __bit                   C2IP                __at(0x1B64);	// @ (0x36C * 8 + 4)
#define                                 C2IP_bit            _BIT_ACCESS(IPR5,4)
// CM2NCH<C2NCH0>
extern volatile __bit                   C2NCH0              __at(0x3B0);	// @ (0x76 * 8 + 0)
#define                                 C2NCH0_bit          _BIT_ACCESS(CM2NCH,0)
// CM2NCH<C2NCH1>
extern volatile __bit                   C2NCH1              __at(0x3B1);	// @ (0x76 * 8 + 1)
#define                                 C2NCH1_bit          _BIT_ACCESS(CM2NCH,1)
// CM2NCH<C2NCH2>
extern volatile __bit                   C2NCH2              __at(0x3B2);	// @ (0x76 * 8 + 2)
#define                                 C2NCH2_bit          _BIT_ACCESS(CM2NCH,2)
// CM2CON0<C2OUT>
extern volatile __bit                   C2OUT               __at(0x3A6);	// @ (0x74 * 8 + 6)
#define                                 C2OUT_bit           _BIT_ACCESS(CM2CON0,6)
// CM2PCH<C2PCH0>
extern volatile __bit                   C2PCH0              __at(0x3B8);	// @ (0x77 * 8 + 0)
#define                                 C2PCH0_bit          _BIT_ACCESS(CM2PCH,0)
// CM2PCH<C2PCH1>
extern volatile __bit                   C2PCH1              __at(0x3B9);	// @ (0x77 * 8 + 1)
#define                                 C2PCH1_bit          _BIT_ACCESS(CM2PCH,1)
// CM2PCH<C2PCH2>
extern volatile __bit                   C2PCH2              __at(0x3BA);	// @ (0x77 * 8 + 2)
#define                                 C2PCH2_bit          _BIT_ACCESS(CM2PCH,2)
// CM2CON0<C2POL>
extern volatile __bit                   C2POL               __at(0x3A4);	// @ (0x74 * 8 + 4)
#define                                 C2POL_bit           _BIT_ACCESS(CM2CON0,4)
// CM2CON0<C2SYNC>
extern volatile __bit                   C2SYNC              __at(0x3A0);	// @ (0x74 * 8 + 0)
#define                                 C2SYNC_bit          _BIT_ACCESS(CM2CON0,0)
// ADCON3<CALC0>
extern volatile __bit                   CALC0               __at(0x1FB4);	// @ (0x3F6 * 8 + 4)
#define                                 CALC0_bit           _BIT_ACCESS(ADCON3,4)
// ADCON3<CALC1>
extern volatile __bit                   CALC1               __at(0x1FB5);	// @ (0x3F6 * 8 + 5)
#define                                 CALC1_bit           _BIT_ACCESS(ADCON3,5)
// ADCON3<CALC2>
extern volatile __bit                   CALC2               __at(0x1FB6);	// @ (0x3F6 * 8 + 6)
#define                                 CALC2_bit           _BIT_ACCESS(ADCON3,6)
// CCP1CAP<CCP1CTS0>
extern volatile __bit                   CCP1CTS0            __at(0x1A18);	// @ (0x343 * 8 + 0)
#define                                 CCP1CTS0_bit        _BIT_ACCESS(CCP1CAP,0)
// CCP1CAP<CCP1CTS1>
extern volatile __bit                   CCP1CTS1            __at(0x1A19);	// @ (0x343 * 8 + 1)
#define                                 CCP1CTS1_bit        _BIT_ACCESS(CCP1CAP,1)
// CCP1CAP<CCP1CTS2>
extern volatile __bit                   CCP1CTS2            __at(0x1A1A);	// @ (0x343 * 8 + 2)
#define                                 CCP1CTS2_bit        _BIT_ACCESS(CCP1CAP,2)
// CCP1CON<CCP1EN>
extern volatile __bit                   CCP1EN              __at(0x1A17);	// @ (0x342 * 8 + 7)
#define                                 CCP1EN_bit          _BIT_ACCESS(CCP1CON,7)
// CCP1CON<CCP1FMT>
extern volatile __bit                   CCP1FMT             __at(0x1A14);	// @ (0x342 * 8 + 4)
#define                                 CCP1FMT_bit         _BIT_ACCESS(CCP1CON,4)
// PIE3<CCP1IE>
extern volatile __bit                   CCP1IE              __at(0x255E);	// @ (0x4AB * 8 + 6)
#define                                 CCP1IE_bit          _BIT_ACCESS(PIE3,6)
// PIR3<CCP1IF>
extern volatile __bit                   CCP1IF              __at(0x25B6);	// @ (0x4B6 * 8 + 6)
#define                                 CCP1IF_bit          _BIT_ACCESS(PIR3,6)
// IPR3<CCP1IP>
extern volatile __bit                   CCP1IP              __at(0x1B56);	// @ (0x36A * 8 + 6)
#define                                 CCP1IP_bit          _BIT_ACCESS(IPR3,6)
// PMD2<CCP1MD>
extern volatile __bit                   CCP1MD              __at(0x32F);	// @ (0x65 * 8 + 7)
#define                                 CCP1MD_bit          _BIT_ACCESS(PMD2,7)
// CCP1CON<CCP1MODE0>
extern volatile __bit                   CCP1MODE0           __at(0x1A10);	// @ (0x342 * 8 + 0)
#define                                 CCP1MODE0_bit       _BIT_ACCESS(CCP1CON,0)
// CCP1CON<CCP1MODE1>
extern volatile __bit                   CCP1MODE1           __at(0x1A11);	// @ (0x342 * 8 + 1)
#define                                 CCP1MODE1_bit       _BIT_ACCESS(CCP1CON,1)
// CCP1CON<CCP1MODE2>
extern volatile __bit                   CCP1MODE2           __at(0x1A12);	// @ (0x342 * 8 + 2)
#define                                 CCP1MODE2_bit       _BIT_ACCESS(CCP1CON,2)
// CCP1CON<CCP1MODE3>
extern volatile __bit                   CCP1MODE3           __at(0x1A13);	// @ (0x342 * 8 + 3)
#define                                 CCP1MODE3_bit       _BIT_ACCESS(CCP1CON,3)
// CCP1CON<CCP1OUT>
extern volatile __bit                   CCP1OUT             __at(0x1A15);	// @ (0x342 * 8 + 5)
#define                                 CCP1OUT_bit         _BIT_ACCESS(CCP1CON,5)
// CCP1PPS<CCP1PPS0>
extern volatile __bit                   CCP1PPS0            __at(0x1278);	// @ (0x24F * 8 + 0)
#define                                 CCP1PPS0_bit        _BIT_ACCESS(CCP1PPS,0)
// CCP1PPS<CCP1PPS1>
extern volatile __bit                   CCP1PPS1            __at(0x1279);	// @ (0x24F * 8 + 1)
#define                                 CCP1PPS1_bit        _BIT_ACCESS(CCP1PPS,1)
// CCP1PPS<CCP1PPS2>
extern volatile __bit                   CCP1PPS2            __at(0x127A);	// @ (0x24F * 8 + 2)
#define                                 CCP1PPS2_bit        _BIT_ACCESS(CCP1PPS,2)
// CCP1PPS<CCP1PPS3>
extern volatile __bit                   CCP1PPS3            __at(0x127B);	// @ (0x24F * 8 + 3)
#define                                 CCP1PPS3_bit        _BIT_ACCESS(CCP1PPS,3)
// CCP1PPS<CCP1PPS4>
extern volatile __bit                   CCP1PPS4            __at(0x127C);	// @ (0x24F * 8 + 4)
#define                                 CCP1PPS4_bit        _BIT_ACCESS(CCP1PPS,4)
// CCP1PPS<CCP1PPS5>
extern volatile __bit                   CCP1PPS5            __at(0x127D);	// @ (0x24F * 8 + 5)
#define                                 CCP1PPS5_bit        _BIT_ACCESS(CCP1PPS,5)
// FVRCON<CDAFVR0>
extern volatile __bit                   CDAFVR0             __at(0x1EBA);	// @ (0x3D7 * 8 + 2)
#define                                 CDAFVR0_bit         _BIT_ACCESS(FVRCON,2)
// FVRCON<CDAFVR1>
extern volatile __bit                   CDAFVR1             __at(0x1EBB);	// @ (0x3D7 * 8 + 3)
#define                                 CDAFVR1_bit         _BIT_ACCESS(FVRCON,3)
// OSCCON2<CDIV0>
extern volatile __bit                   CDIV0               __at(0x570);	// @ (0xAE * 8 + 0)
#define                                 CDIV0_bit           _BIT_ACCESS(OSCCON2,0)
// OSCCON2<CDIV1>
extern volatile __bit                   CDIV1               __at(0x571);	// @ (0xAE * 8 + 1)
#define                                 CDIV1_bit           _BIT_ACCESS(OSCCON2,1)
// OSCCON2<CDIV2>
extern volatile __bit                   CDIV2               __at(0x572);	// @ (0xAE * 8 + 2)
#define                                 CDIV2_bit           _BIT_ACCESS(OSCCON2,2)
// OSCCON2<CDIV3>
extern volatile __bit                   CDIV3               __at(0x573);	// @ (0xAE * 8 + 3)
#define                                 CDIV3_bit           _BIT_ACCESS(OSCCON2,3)
// MD1CARH<CH0>
extern volatile __bit                   CH0                 __at(0x370);	// @ (0x6E * 8 + 0)
#define                                 CH0_bit             _BIT_ACCESS(MD1CARH,0)
// MD1CARH<CH1>
extern volatile __bit                   CH1                 __at(0x371);	// @ (0x6E * 8 + 1)
#define                                 CH1_bit             _BIT_ACCESS(MD1CARH,1)
// MD1CARH<CH2>
extern volatile __bit                   CH2                 __at(0x372);	// @ (0x6E * 8 + 2)
#define                                 CH2_bit             _BIT_ACCESS(MD1CARH,2)
// MD1CARH<CH3>
extern volatile __bit                   CH3                 __at(0x373);	// @ (0x6E * 8 + 3)
#define                                 CH3_bit             _BIT_ACCESS(MD1CARH,3)
// MD1CON1<CHPOL>
extern volatile __bit                   CHPOL               __at(0x35D);	// @ (0x6B * 8 + 5)
#define                                 CHPOL_bit           _BIT_ACCESS(MD1CON1,5)
// MD1CON1<CHSYNC>
extern volatile __bit                   CHSYNC              __at(0x35C);	// @ (0x6B * 8 + 4)
#define                                 CHSYNC_bit          _BIT_ACCESS(MD1CON1,4)
// T0CON1<CKPS3>
extern volatile __bit                   CKPS3               __at(0x18DB);	// @ (0x31B * 8 + 3)
#define                                 CKPS3_bit           _BIT_ACCESS(T0CON1,3)
// NCO1CLK<CKS0>
extern volatile __bit                   CKS0                __at(0x2238);	// @ (0x447 * 8 + 0)
#define                                 CKS0_bit            _BIT_ACCESS(NCO1CLK,0)
// NCO1CLK<CKS1>
extern volatile __bit                   CKS1                __at(0x2239);	// @ (0x447 * 8 + 1)
#define                                 CKS1_bit            _BIT_ACCESS(NCO1CLK,1)
// NCO1CLK<CKS2>
extern volatile __bit                   CKS2                __at(0x223A);	// @ (0x447 * 8 + 2)
#define                                 CKS2_bit            _BIT_ACCESS(NCO1CLK,2)
// NCO1CLK<CKS3>
extern volatile __bit                   CKS3                __at(0x223B);	// @ (0x447 * 8 + 3)
#define                                 CKS3_bit            _BIT_ACCESS(NCO1CLK,3)
// NCO1CLK<CKS4>
extern volatile __bit                   CKS4                __at(0x223C);	// @ (0x447 * 8 + 4)
#define                                 CKS4_bit            _BIT_ACCESS(NCO1CLK,4)
// MD1CARL<CL0>
extern volatile __bit                   CL0                 __at(0x368);	// @ (0x6D * 8 + 0)
#define                                 CL0_bit             _BIT_ACCESS(MD1CARL,0)
// MD1CARL<CL1>
extern volatile __bit                   CL1                 __at(0x369);	// @ (0x6D * 8 + 1)
#define                                 CL1_bit             _BIT_ACCESS(MD1CARL,1)
// MD1CARL<CL2>
extern volatile __bit                   CL2                 __at(0x36A);	// @ (0x6D * 8 + 2)
#define                                 CL2_bit             _BIT_ACCESS(MD1CARL,2)
// MD1CARL<CL3>
extern volatile __bit                   CL3                 __at(0x36B);	// @ (0x6D * 8 + 3)
#define                                 CL3_bit             _BIT_ACCESS(MD1CARL,3)
// PIE0<CLC1IE>
extern volatile __bit                   CLC1IE              __at(0x2545);	// @ (0x4A8 * 8 + 5)
#define                                 CLC1IE_bit          _BIT_ACCESS(PIE0,5)
// PIR0<CLC1IF>
extern volatile __bit                   CLC1IF              __at(0x259D);	// @ (0x4B3 * 8 + 5)
#define                                 CLC1IF_bit          _BIT_ACCESS(PIR0,5)
// IPR0<CLC1IP>
extern volatile __bit                   CLC1IP              __at(0x1B3D);	// @ (0x367 * 8 + 5)
#define                                 CLC1IP_bit          _BIT_ACCESS(IPR0,5)
// PMD4<CLC1MD>
extern volatile __bit                   CLC1MD              __at(0x339);	// @ (0x67 * 8 + 1)
#define                                 CLC1MD_bit          _BIT_ACCESS(PMD4,1)
// CLCDATA<CLC1OUT>
extern volatile __bit                   CLC1OUT             __at(0x6A0);	// @ (0xD4 * 8 + 0)
#define                                 CLC1OUT_bit         _BIT_ACCESS(CLCDATA,0)
// PIE5<CLC2IE>
extern volatile __bit                   CLC2IE              __at(0x256D);	// @ (0x4AD * 8 + 5)
#define                                 CLC2IE_bit          _BIT_ACCESS(PIE5,5)
// PIR5<CLC2IF>
extern volatile __bit                   CLC2IF              __at(0x25C5);	// @ (0x4B8 * 8 + 5)
#define                                 CLC2IF_bit          _BIT_ACCESS(PIR5,5)
// IPR5<CLC2IP>
extern volatile __bit                   CLC2IP              __at(0x1B65);	// @ (0x36C * 8 + 5)
#define                                 CLC2IP_bit          _BIT_ACCESS(IPR5,5)
// PMD4<CLC2MD>
extern volatile __bit                   CLC2MD              __at(0x33A);	// @ (0x67 * 8 + 2)
#define                                 CLC2MD_bit          _BIT_ACCESS(PMD4,2)
// CLCDATA<CLC2OUT>
extern volatile __bit                   CLC2OUT             __at(0x6A1);	// @ (0xD4 * 8 + 1)
#define                                 CLC2OUT_bit         _BIT_ACCESS(CLCDATA,1)
// PIE7<CLC3IE>
extern volatile __bit                   CLC3IE              __at(0x257D);	// @ (0x4AF * 8 + 5)
#define                                 CLC3IE_bit          _BIT_ACCESS(PIE7,5)
// PIR7<CLC3IF>
extern volatile __bit                   CLC3IF              __at(0x25D5);	// @ (0x4BA * 8 + 5)
#define                                 CLC3IF_bit          _BIT_ACCESS(PIR7,5)
// IPR7<CLC3IP>
extern volatile __bit                   CLC3IP              __at(0x1B75);	// @ (0x36E * 8 + 5)
#define                                 CLC3IP_bit          _BIT_ACCESS(IPR7,5)
// PMD4<CLC3MD>
extern volatile __bit                   CLC3MD              __at(0x33B);	// @ (0x67 * 8 + 3)
#define                                 CLC3MD_bit          _BIT_ACCESS(PMD4,3)
// CLCDATA<CLC3OUT>
extern volatile __bit                   CLC3OUT             __at(0x6A2);	// @ (0xD4 * 8 + 2)
#define                                 CLC3OUT_bit         _BIT_ACCESS(CLCDATA,2)
// PIE8<CLC4IE>
extern volatile __bit                   CLC4IE              __at(0x2585);	// @ (0x4B0 * 8 + 5)
#define                                 CLC4IE_bit          _BIT_ACCESS(PIE8,5)
// PIR8<CLC4IF>
extern volatile __bit                   CLC4IF              __at(0x25DD);	// @ (0x4BB * 8 + 5)
#define                                 CLC4IF_bit          _BIT_ACCESS(PIR8,5)
// IPR8<CLC4IP>
extern volatile __bit                   CLC4IP              __at(0x1B7D);	// @ (0x36F * 8 + 5)
#define                                 CLC4IP_bit          _BIT_ACCESS(IPR8,5)
// PMD4<CLC4MD>
extern volatile __bit                   CLC4MD              __at(0x33C);	// @ (0x67 * 8 + 4)
#define                                 CLC4MD_bit          _BIT_ACCESS(PMD4,4)
// CLCDATA<CLC4OUT>
extern volatile __bit                   CLC4OUT             __at(0x6A3);	// @ (0xD4 * 8 + 3)
#define                                 CLC4OUT_bit         _BIT_ACCESS(CLCDATA,3)
// CLCIN0PPS<CLCIN0PPS0>
extern volatile __bit                   CLCIN0PPS0          __at(0x1308);	// @ (0x261 * 8 + 0)
#define                                 CLCIN0PPS0_bit      _BIT_ACCESS(CLCIN0PPS,0)
// CLCIN0PPS<CLCIN0PPS1>
extern volatile __bit                   CLCIN0PPS1          __at(0x1309);	// @ (0x261 * 8 + 1)
#define                                 CLCIN0PPS1_bit      _BIT_ACCESS(CLCIN0PPS,1)
// CLCIN0PPS<CLCIN0PPS2>
